Public Attributes | List of all members
API_TranslatorNameConfig Struct Reference
Publisher
Represents a translator by its GUID and its name. More...
#include <APIdefs_Registration.h>
 Public Attributes
API_Guid  | guid
Unique ID of the translator.
GS::UniString  | translatorName
Name of the translator.
Detailed Description
Represents a translator by its GUID and its name.
Member Data Documentation
◆ guid
 API_TranslatorNameConfig::guid
Unique ID of the translator.
◆ translatorName
 API_TranslatorNameConfig::translatorName
Name of the translator.